---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupsHaveDifferentMembers
source: html/7048cc9d-398d-e008-8c0e-45c7eb5ebc52.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupsHaveDifferentMembers Property

Group instances of the same type do not contain identical members. Press "Fix Groups..." to select from options to make
 the groups consistent.\nCorresponding group members in different group instances diverge in the following respects:[Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupsHaveDifferentMembers { get; }
```